In [42]:
import pandas as pd
nba = pd.read_csv("nba_all_elo.csv")
type(nba)
pd.set_option("display.max.columns", None)
pd.set_option("display.max.rows", 6)
pd.set_option("display.precision", 2)

In [4]:
print(len(nba))
print(nba.shape) #dimensionalità - righe e colonne

126314
(126314, 23)

In [10]:
nba.head()  #head e tail per mostrare le prime (head) e ultime (tail) righe

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [45]:
nba.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.41,1704.39,60.31,GSW,Warriors,103,1790.96,1809.98,H,L,0.55,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.98,1813.63,68.01,CLE,Cavaliers,91,1704.39,1700.74,H,W,0.77,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [125]:
import numpy as np
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast,date_played
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50,1988-04-09 00:53:18.429311104
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02,1946-11-01 00:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67,2003-03-19 00:00:00
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98,2015-06-16 00:00:00
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22,NaN

In [17]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [43]:
nba['team_id'].value_counts()

team_id
BOS    5997
NYK    5769
LAL    5078
       ...
TRH      60
DTF      60
SDS      11
Name: count, Length: 104, dtype: int64

In [44]:
nba['fran_id'].value_counts()

fran_id
Lakers     6024
Celtics    5997
Knicks     5769
           ...
Jets         60
Huskies      60
Falcons      60
Name: count, Length: 53, dtype: int64

In [123]:
nba.loc[nba['fran_id'] == 'Lakers','team_id'].value_counts()

team_id
LAL    5078
MNL     946
Name: count, dtype: int64

In [51]:
nba['date_played'] = pd.to_datetime(nba['date_game'])
print(nba.shape)

(126314, 24)

In [55]:
nba.loc[nba['team_id'] == "MNL",'date_played'].min()

1136   1948-11-04
1152   1948-11-06
1159   1948-11-09
          ...
9709   1960-03-22
9711   1960-03-24
9715   1960-03-26
Name: date_played, Length: 946, dtype: datetime64[ns]

In [57]:
#Creiamo delle strutture più semplice adesso 
#Series
revenues = pd.Series([5555, 7000, 1980])

#Oggetto Series: valori e identificatori (indici)
revenues

0    5555
1    7000
2    1980
dtype: int64

In [60]:
print(revenues.values)
print(revenues.index)

[5555 7000 1980]
RangeIndex(start=0, stop=3, step=1)

pandas.core.indexes.range.RangeIndex

In [65]:
#cambiamo indici di una serie - questa conferisce un comportamento 
# più da dizionario, mentre quella prima e più simile a una lista
city_revenue = pd.Series(
    [5000, 6000, 7000],
    index=["Roma", "Trieste", "Milano"]
)
city_revenue

Roma       5000
Trieste    6000
Milano     7000
dtype: int64

In [70]:
#costruzione di una serie direttamente da un dizionario
# Attenzione che qui non c'è informazione per Milano
city_employees = pd.Series({"Roma": 50, "Trieste": 40})
city_employees

Roma       50
Trieste    40
dtype: int64

In [67]:
#Con le Pandas Serie, possiamo anche usare funzionalità dei dizionari:
"Udine" in city_employees

False

In [68]:
"Roma" in city_employees

True

In [71]:
# Combiniamo le serie di Pandas per fare un "Data Frame"
# Guardate il numero di "employees" per Milano - NaN not a number 
city_data = pd.DataFrame({
    "revenue": city_revenue,
    "empoloyees": city_employees
    })
city_data

         revenue  empoloyees
Milano      7000         NaN
Roma        5000        50.0
Trieste     6000        40.0

In [72]:
#I valori di city_data fanno un array
city_data.values

array([[7000.,   nan],
       [5000.,   50.],
       [6000.,   40.]])

In [75]:
#Ci sono anche due assi del Data Frame - le 2 dimensioni
print(city_data.axes)
print(city_data.axes[0])  #indici delle righe
print(city_data.axes[1])  # indici delle colonne

[Index(['Milano', 'Roma', 'Trieste'], dtype='object'), Index(['revenue', 'empoloyees'], dtype='object')]
Index(['Milano', 'Roma', 'Trieste'], dtype='object')
Index(['revenue', 'empoloyees'], dtype='object')

In [76]:
#L'utilizzo di una tecnica dei dizionari con un dataframe:
"pts" in nba

True

In [79]:
# per mostrare le colonne del dataframe di prima
nba.axes

[RangeIndex(start=0, stop=126314, step=1),
 Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
        'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
        'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
        'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
        'date_played'],
       dtype='object')]

In [91]:
# Utilizzo di slices con pandas serie
city_revenue[-1::-1]

Milano     7000
Trieste    6000
Roma       5000
dtype: int64

In [93]:
#.loc e .iloc
# Prima creiamo una nuova serie
colori = pd.Series(
    ["rosso", "viola", "blue", "verde", "giallo"],
    index=[1, 2, 3, 5, 8]
)
colori

1     rosso
2     viola
3      blue
5     verde
8    giallo
dtype: object

In [99]:
#.loc cerca in base dell'indice del label 
colori.loc[3]

'blue'

In [100]:
#.iloc cerca in base dell'indice posizionale
# tramite questo metodo vediamo un altro risultato:
colori.iloc[3]

'verde'

In [102]:
#ci sono modi particolari per applicare dei slicing alla serie:
# .loc[1:3] per esempio, include l'ultimo indice, mentre
# .iloc[1:3] non includerà l'ultimo
print(colori.loc[1:3])
print(colori.iloc[1:3])

1    rosso
2    viola
3     blue
dtype: object
2    viola
3     blue
dtype: object

In [105]:
#per applicare l'indice a un Data Frame:
print(city_data["revenue"])

# oppure, per un nome di colonna di tipo "stringa"

print(city_data.revenue)

Milano     7000
Roma       5000
Trieste    6000
Name: revenue, dtype: int64
Milano     7000
Roma       5000
Trieste    6000
Name: revenue, dtype: int64

In [109]:
#Utilizzo di .loc (labels) e .iloc (indici)
print(city_data.loc["Roma"])
print(city_data.loc["Roma":"Trieste"])

print(city_data.iloc[0])

revenue       5000.0
empoloyees      50.0
Name: Roma, dtype: float64
         revenue  empoloyees
Roma        5000        50.0
Trieste     6000        40.0
revenue       7000.0
empoloyees       NaN
Name: Milano, dtype: float64

In [117]:
#sfida: provate a scrivere codice per mostrare la penultima riga del NBA dataset

pandas.core.series.Series

In [118]:
#i dataframe accettano anche un secondo argomento per filtrare le colonne. 
#potete anche mettere più argomenti in una lista per quest'argomento
#Per esempio, questo mostra solo "revenue" per il Data Frame
city_data.loc["Roma": "Trieste", "revenue"]

Roma       5000
Trieste    6000
Name: revenue, dtype: int64

In [130]:
# sfida: cercare tutte le partite in data frame nba da 5555 a 5559. 
# Mostrare solo i nomi delle squadre e pts
nba.loc[5555:5559,['fran_id', 'pts', 'opp_fran', 'opp_pts']]

      fran_id  pts  opp_fran  opp_pts
5555  Pistons   83  Warriors       56
5556  Celtics   95    Knicks       74
5557   Knicks   74   Celtics       95
5558    Kings   81    Sixers       86
5559   Sixers   86     Kings       81